#-*- encoding: utf8 -*-
'''
    Module
'''

import unittest,os
import unittest,os,sys
sys.path.append( os.getcwd() )
from renumerate.IncomeStatement import incomeStatement
from renumerate.CategoryHint import categoryHinter
from renumerate.PenaltyEngine import penaltyEngine
from StringIO import StringIO

'''
sample negative  一1,260,000
'''

example1 = '''
平成18年度 特定非常利活動1一0賃る事業会計収支,書十算書
平成18年4月1日から平成19年3月31日まで
特定業常和活動構人 ま億らげ講費事業団
の 料 百 金 額 （単位 1 円）
1)
1経常収入の部
1一会費収入
会費収入 2 990 000 2, 990,000
2,寄昭金収入
一161寄1・1一金1111入 3 414 115 3,414,115
3,事業取入
(1) 書成年六4賃支事業 2, 024, 000
(2) 家01」5・<13<1・開5・ま4・賃1道,七 し1「二 事業 680, 800
(3）,講1書五11「三道1二<三る事業収入 0
(4) 7受億付事 支12賃事業 0 2, 704, 800
4,補助金等収入
地方公共団体補助金1位入 0
民開助成金117入 1 000 000 1,000,000
5,・費の地収入
機収人 ・ 手11息[1賃1入 4 858 4 858
11受常】111入合賃・1 10 113 773
8算常支出の部
1・事業費
（1)書・』×・年書費支4賃8 し7二8千11費五11】<支】賃講業
会構費 , 1,636, 251
7手事道・常費 248, 093
1市費支道費 608, 953
会講1費 49,330
補品1開講品費 126,717
1五18賃億費・ 150,932
5講億道機費 213,319
費料日1品・1費 71, 795
1品構料 41,790
講費 ・ 雑費 70 013 3, 217, 193
（2)額81五万(げ講・,算二村書三1上 し7二事業 （講（書73・一市」二,)
金品費・ , 416, 363
1手事道常費 130, 950
15二113タ三寄五講費 134, 550
会講書費 0
1構品7構1事百品・貸 10,613
0<講8算1書費 27,183
18「書五事機費 29, 146
費料日1品・1費 17, 073
講費 ・ 雑費 , 28 535 794,413
(3）講町11講】賃事業道・賃費 0 0
（4）度度町書出販』費1支事業5事常費 30 800 30, 800
（5)7書5賃手7事支億費 0 0
事業費合計 4 042 406
2,貸講費
会講費 107,382
寄6料手座・ 2, 209, 448
万講費書「×賃道費 197,111
1五講1三1賃料費 33,075
構11品上1事24￥費 26, 365
道1百道構費 228, 661
1月講道1十講億品費 69, 440
11書1講5品費・ 45, 869
  882,000
)1<道)・位講書8費 117, 325
構構・一公構 1,000
支払手ま賃（料 8, 830
講費・ 14,464
」1<払金支11』 153, 087
預 9 金支払 30, 000
<賃1三五費合計 , 4 124 057
寄受常支出合計 8 166 463
, 構常収支道額 1 947 310
町るの地貸金収入の部
却151金 , 29,110
・賃の地費金11)1入合書十 0 29 110
位講の地費金支出の都
預り金 30,000
千億費 , 0
￥2・の11書,費金支出合計 30 000
・での地費金・111支費額 890
講講費書講書部 0 000 000
・ 1 624 574
り2期構構収支費額 ・・・ ・・
《三1三11ま費1度1書算の部)
1】三三1講6ま度1費1】書の費11
当19収支道額 (講18) 1,948, 200
6011,83 (4 月タ)費料) 73,500
講て金 136, 000
三1賃収金 , 29 110
構7」11額合賃十 2 186 810 2 186 810
昭年府動度町出の部
預り 金 , 30 000
講9>額合11十 30 000 30 000
費等講講講書費111額 2 156 810
1111 1 624 674
当1111年11ま日】1商合計額 ・・
'''  

class TestSuite(unittest.TestCase):
    
    def setUp(self):
        self.ch = categoryHinter( os.path.join('config', 'test-jcategories.conf') )
        self.pe = penaltyEngine
        self.obj = incomeStatement( self.ch, self.pe )

    def testExample1(self):
        self.obj.read( example1 )
        self.obj.analyze()
        self.assertEqual( self.obj, [2990000L, 2990000L, 3414115L, 3414115L, 2024000L, 680800L, 2704800L, 1000000L, 1000000L, 4858L, 10113773L])

if __name__ == "__main__":
    #unittest.main()
    unittest.TextTestRunner().run(TestSuite('testExample1'))

